test/load-test.yml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 10
      arrivalRate: 1000
  defaults:
    headers:
      Content-Type: application/json
      X-Request-ID: "stress-test"
      x-api-key: "supersecretkey"

scenarios:
  - name: Test GET and POST on API Gateway
    flow:
      - get:
          url: "/api/auth/healthz"
      - post:
          url: "/api/auth/echo"
          json:
            hello: "gateway"